Repository: digivod-gmbh/training-solution
Catalog: labelme/locale/*/LC_MESSAGES/labelme.po
Languages: de_de

source: Statistics
de_de: Statistik

source: Polygon Labels
de_de: Markierungen

source: Select label to start annotating for it. Double-click to filter by label. Press 'Esc' to deselect.
de_de: Wählen Sie eine Kategorie, um mit der Markierung dafür zu beginnen. Drücken Sie 'Esc' zum Abwählen.

source: Label List
de_de: Kategorien

source: Search:
de_de: Suche:

source: - all images -
de_de: - Alle Bilder -

source: Labeled
de_de: Mit Markierung(en)

source: Unlabeled
de_de: Ohne Markierung(en)

source: Reset
de_de: Zurücksetzen

source: Search Filename
de_de: Datei suchen

source: Search
de_de: Suchen

source: File List
de_de: Dateien

source: &Quit
de_de: Beenden

source: Quit application
de_de: Beenden

source: &Open Dir
de_de: &Ordner öffnen

source: Open Dir
de_de: Ordner öffnen

source: &Settings
de_de: &Einstellungen

source: Settings
de_de: Einstellungen

source: Import images
de_de: Bilder importieren

source: Export images
de_de: Bilder exportieren

source: Train a network
de_de: Ein neuronales Netz trainieren

source: &Validation
de_de: &Validierung

source: Validate training results
de_de: Trainingergebnisse validieren

source: &Next Image
de_de: &Nächstes Bild

source: Open next (hold Ctl+Shift to copy labels)
de_de: Nächstes öffnen (Strg+Shift halten um Markierung(en) zu kopieren)

source: &Prev Image
de_de: &Vorheriges Bild

source: Open prev (hold Ctl+Shift to copy labels)
de_de: Vorheriges öffnen (Strg+Shift halten um Markierung(en) zu kopieren)

source: &Save
de_de: &Speichern

source: Save labels to file
de_de: Markierung(en) in Datei speichern

source: &Save As
de_de: &Speichern unter

source: Save labels to a different file
de_de: Markierung(en) in einer anderen Datei speichern

source: &Delete File
de_de: &Alles löschen

source: Delete current label file
de_de: Alle Markierungen im aktuellen Bild löschen

source: &Change Output Dir
de_de: &Ausgabeordner wechseln

source: Change where annotations are loaded/saved
de_de: Speicherort der Annotationen ändern

source: Save &Automatically
de_de: Automatisch &Speichern

source: Save automatically
de_de: Automatisch speichern

source: &Close
de_de: &Schließen

source: Close current file
de_de: Aktuelle Datei schließen

source: Polygon &Line Color
de_de: Markierung &Linienfarbe

source: Choose polygon line color
de_de: Wähle Markierung Linienfarbe

source: Polygon &Fill Color
de_de: Markierung &Füllfarbe

source: Choose polygon fill color
de_de: Wähle Markierung Füllfarbe

source: Keep Previous Annotation
de_de: Vorherige Annotationen beibehalten

source: Toggle "keep pevious annotation" mode
de_de: Modus "vorherige Annotationen beibehalten" umschalten

source: Create Rectangle
de_de: Neue Markierung erstellen

source: Start drawing rectangles
de_de: Wechselt in den Markierungsmodus, in dem Sie Rechtecke zeichnen können

source: Edit mode
de_de: Bearbeitungsmodus

source: Move and edit the selected polygons
de_de: Markierung(en) auswählen, bewegen und bearbeiten

source: Select polygon
de_de: Markierung auswählen

source: Select the polygon you right-clicked on
de_de: Wählen Sie die Markierung aus, auf die Sie geklickt haben

source: Delete Polygons
de_de: Markierung(en) löschen

source: Delete the selected polygons
de_de: Ausgewählte Markierung löschen

source: Duplicate Polygons
de_de: Markierung(en) duplizieren

source: Create a duplicate of the selected polygons
de_de: Ausgewählte Markierung(en) duplizieren

source: Undo last point
de_de: Letzten Punkt rückgängig

source: Undo last drawn point
de_de: Zuletzt gezeichneten Punkt rückgängig machen

source: Add Point to Edge
de_de: Punkt zu Kante hinzufügen

source: Add point to the nearest edge
de_de: Punkt zu nächster Kante hinzufügen

source: Undo
de_de: Rückgängig

source: Undo last add and edit of shape
de_de: Letzte Änderung rückgängig machen

source: &Hide Polygons
de_de: Markierung(en) ausblenden

source: Hide all polygons
de_de: Alle Markierungen ausblenden

source: &Show Polygons
de_de: Markierung(en) einblenden

source: Show all polygons
de_de: Alle Markierungen einblenden

source: &About
de_de: Über

source: Show about page
de_de: Über

source: Open log folder
de_de: Log-Ordner öffnen

source: Zoom in or out of the image. Also accessible with {} and {} from the canvas.
de_de: Zoomen Sie in das oder aus dem Bild. Auch verfügbar durch {} und {} aus dem Zeichenbereich.

source: Zoom &In
de_de: Zoom &+

source: Increase zoom level
de_de: Zoomlevel erhöhen

source: &Zoom Out
de_de: Zoom &-

source: &Original size
de_de: Originalgröße

source: Zoom to original size
de_de: Auf Originalgröße zoomen

source: &Fit Window
de_de: Zoom Fenster

source: Zoom follows window size
de_de: Auf Fenstergröße zoomen

source: Fit &Width
de_de: Zoom Breite

source: Zoom follows window width
de_de: Auf Fensterbreite zoomen

source: &Edit Label
de_de: Kategorie bearbeiten

source: Modify the label of the selected polygon
de_de: Bearbeiten Sie die Kategorie der ausgewählten Markierung

source: Shape &Line Color
de_de: Form &Linienfarbe

source: Change the line color for this specific shape
de_de: Ändern Sie die Linienfarbe für diese Form

source: Shape &Fill Color
de_de: Form &Füllfarbe

source: Change the fill color for this specific shape
de_de: Ändern Sie die Füllfarbe für diese Form

source: &File
de_de: &Datei

source: &Edit
de_de: &Bearbeiten

source: &View
de_de: &Ansicht

source: &Project
de_de: &Projekt

source: &Help
de_de: &Hilfe

source: Open &Recent
de_de: Zuletzt geöffnet

source: Tools
de_de: Werkzeuge

source: %s started.
de_de: %s gestartet.

source: If `auto_save` argument is True, `output_file` argument is ignored and output filename is automatically set as IMAGE_BASENAME.json.
de_de: Wenn der Parameter `auto_save` True ist, wird `output_file` ignoriert und der Dateiname wird automatisch auf IMAGE_BASENAME.json gesetzt.

source: No project folder is defined in settings. Please configure one.
de_de: Es ist kein Projektordner in den Einstellungen hinterlegt. Bitte hinterlegen Sie dort einen Ordner, in dem alle Importe, Datensätze und Trainings gespeichert werden können.

source: An easy-to-use tool for training of object detection networks
de_de: Ein Werkzeug für das Training von neuronalen Netzen zur Objekterkennung

source: This software uses icons from {}
de_de: Diese Software nutzt Icons von {}

source: Invalid label
de_de: Ungültige Kategorie

source: Invalid label "{}" with validation type "{}"
de_de: Ungültige Kategorie "{}" mit Validierungstyp "{}"

source: Error saving label data
de_de: Fehler beim Speichern der Markierungen

source: No such file: <b>%s</b>
de_de: Datei nicht gefunden: <b>%s</b>

source: Error opening file
de_de: Fehler beim Öffnen

source: Loading %s...
de_de: Lade %s...

source: Make sure <i>%s</i> is a valid label file.
de_de: Stellen Sie sicher, dass <i>%s</i> eine gültige Datei ist.

source: Error reading %s
de_de: Fehler beim Lesen von %s

source: Make sure <i>{}</i> is a valid image file.
de_de: Stellen Sie sicher, dass <i>%s</i> eine gültige Bilddatei ist.

source: Supported image formats: {}
de_de: Unterstützte Bildformate: {}

source: Loaded %s
de_de: %s geladen

source: You are about to permanently delete this label file, proceed anyway?
de_de: Wollen Sie diese Markierung(en) wirklich dauerhaft löschen?

source: Attention
de_de: Achtung

source: Label file is removed: {}
de_de: Labeldatei entfernt: {}

source: No objects labeled
de_de: Keine Objekte annotiert

source: You must label at least one object to save the file.
de_de: Sie müssen mindestens ein Objekt annotieren, um die Datei zu speichern.

source: Save annotations to "{}" before closing?
de_de: Annotationen vor dem Schließen in "{}" speichern?

source: Save annotations?
de_de: Annotationen speichern?

source: Save
de_de: Speichern

source: Discard
de_de: Verwerfen

source: Cancel
de_de: Abbrechen

source: Choose line color
de_de: Linienfarbe wählen

source: Choose fill color
de_de: Füllfarbe wählen

source: You are about to permanently delete {} polygons, proceed anyway?
de_de: Wollen Sie {} Markierung(en) wirklich dauerhaft löschen?

source: %s - Open Directory
de_de: %s - Ordner öffnen

source: - all labels -
de_de: - Alle Kategorien -

source: Input folder must be initialized for import
de_de: Eingabeordner muss für den Import gesetzt sein

source: Writing label files ...
de_de: Labeldateien schreiben ...

source: Split could not be detected
de_de: Aufteilung konnte nicht ermittelt werden

source: Loading dataset ...
de_de: Datensatz laden ...

source: Intermediate format must be initialized for export
de_de: Intermediate-Format muss für den Export initialisiert sein

source: Gathering samples ...
de_de: Proben sammeln ...

source: Writing samples ...
de_de: Schreibe Proben ...

source: The following images could not be exported:
de_de: Folgende Bilder konnten nicht exportiert werden:

source: Warning
de_de: Warnung

source: Dataset contains no images for export
de_de: Der Datensatz enthält keine Bilder für den Export

source: Invalid bbox list: {}
de_de: Ungültige Bounding-Box-Liste: {}

source: Loading image record file ...
de_de: Lade ImageRecord Datei ...

source: Creating training dataset ...
de_de: Trainingdatensatz exportieren ...

source: Creating validation dataset ...
de_de: Validierungsdatensatz erstellen ...

source: Writing dataset ...
de_de: Datensatz schreiben ...

source: Writing sample ...
de_de: Probe schreiben ...

source: Loading model ...
de_de: Modell laden ...

source: Start training ...
de_de: Training starten ...

source: Finished training
de_de: Training beendet

source: Waiting for first validation ...
de_de: Auf erste Validierung warten …

source: Start training on epoch {} ...
de_de: Training in Epoche {} starten ...

source: Finished training on epoch {}
de_de: Training in Epoche {} beendet

source: Training ...
de_de: Trainieren ...

source: Epoch
de_de: Epoche

source: Batch
de_de: Stapel

source: Speed
de_de: Geschwindigkeit

source: samples/sec
de_de: Proben/Sek.

source: Validating...
de_de: Validieren ...

source: An error occured with following message
de_de: Es ist ein Fehler mit folgender Nachricht aufgetreten

source: Yes
de_de: Ja

source: No
de_de: Nein

source: Cancelling ...
de_de: Abbrechen ...

source: Error
de_de: Fehler

source: An error occured. For further details look into the log files
de_de: Es ist ein Fehler aufgetreten. Weitere Details können Sie den Logdateien entnehmen.

source: Initializing ...
de_de: Initialisieren ...

source: Images
de_de: Bilder

source: Annotations
de_de: Annotationen

source: Click & drag to move point
de_de: Klicken & ziehen, um Punkt zu bewegen

source: Click & drag to move shape %s
de_de: Klicken und ziehen, um Markierung %s zu bewegen

source: Help
de_de: Hilfe

source: Help file could not be found
de_de: Hilfedatei konnte nicht gefunden werden

source: Export dataset
de_de: Datensatz exportieren

source: Data folder
de_de: Daten

source: Label selection
de_de: Labelauswahl

source: Browse
de_de: Durchsuchen

source: Dataset name
de_de: Datensatzname

source: Export folder
de_de: Exportordner

source: % of dataset
de_de: % des Datensatzes

source: Validation ratio
de_de: Validierungsrate

source: Please open a folder with images first
de_de: Bitte öffnen Sie zuerst einen Ordner mit Bildern

source: Select output folder
de_de: Bitte wählen Sie einen Ausgabeordner

source: Dataset has been exported successfully
de_de: Datensatz wurde erfolgreich exportiert

source: Please enter a valid data folder
de_de: Bitte geben Sie einen gültigen Datenordner ein

source: Please enter a valid export folder
de_de: Bitte geben Sie einen gültigen Exportordner ein

source: Please select a maximum of {} labels
de_de: Bitte wählen Sie maximal {} Labels

source: Please select at least 1 label
de_de: Bitte wählen Sie mindestens 1 Label

source: Please enter a valid dataset name
de_de: Bitte wählen Sie einen gültigen Namen für den Datensatz

source: The selected output directory "{}" is not empty. All containing files will be deleted. Are you sure to continue?
de_de: Der Ordner "{}" ist nicht leer. Alle enthaltenen Elemente werden gelöscht. Wollen Sie fortfahren?

source: The selected output directory "{}" could not be created
de_de: Der Ordner "{}" konnte nicht erstellt werden

source: Export format {} could not be found
de_de: Exportformat {} konnte nicht gefunden werden

source: Loading data ...
de_de: Daten laden ...

source: Loading ...
de_de: Laden ...

source: Loading images ...
de_de: Bilder laden ...

source: Import dataset
de_de: Datensatz importieren

source: Dataset folder
de_de: Datensatz

source: files
de_de: Dateien

source: Select dataset file
de_de: Datensatz auswählen

source: Select dataset folder
de_de: Bitte wählen Sie einen Datensatz aus

source: Dataset has been imported successfully
de_de: Datensatz wurde erfolgreich importiert

source: Please enter a valid dataset file or folder
de_de: Bitte wählen Sie einen gültigen Datensatz

source: Please enter a valid output folder
de_de: Bitte wählen Sie einen gültigen Ausgabeordner

source: Import format {} could not be found
de_de: Importformat {} konnte nicht gefunden werden

source: Invalid dataset format
de_de: Ungültiges Datensatzformat

source: Validation
de_de: Validierung

source: Minimum confidence
de_de: Minimale Wahrscheinlichkeit

source: unknown
de_de: unbekannt

source: Merge datasets
de_de: Datensätze zusammenführen

source: # Samples
de_de: # Proben

source: Directory
de_de: Ordner

source: Dataset
de_de: Datensatz

source: Add dataset file
de_de: Datensatz hinzufügen

source: Datasets
de_de: Datensätze

source: Merge
de_de: Zusammenführen

source: Dataset files
de_de: Datensatz Dateien

source: Select dataset files
de_de: Datensatz auswählen

source: Dataset file
de_de: Datensatz

source: Save output file as
de_de: Datei speichern unter

source: All dataset files must have the same format
de_de: Alle Datensätze müssen das gleiche Format haben

source: Please select at least 2 datasets to merge
de_de: Bitte wählen Sie mindestens 2 Datensätze zum Zussamenführen

source: Project folder
de_de: Projektordner

source: Single-label mode
de_de: Ein-Label-Modus

source: Select project folder
de_de: Projektordner auswählen

source: You must specify a label name in single-label mode
de_de: Sie müssen einen Labelnamen festlegen, wenn Sie den Ein-Label-Modus verwenden wollen

source: Project folder must not be empty
de_de: Projektordner muss leer sein

source: Network
de_de: Netz

source: Resume training
de_de: Training fortführen

source: Epochs
de_de: Epochen

source: Batch size
de_de: Stapelgröße

source: Learning rate
de_de: Lernrate

source: Early stop epochs
de_de: Early-Stop Epochen

source: No GPUs available
de_de: Keine GPUs verfügbar

source: Create dataset from opened images
de_de: Datensatz aus geöffneten Bildern erzeugen

source: Create dataset
de_de: Datensatz erstellen

source: Training dataset
de_de: Trainingdaten

source: Validation dataset
de_de: Validierungsdaten

source: Use dataset file(s)
de_de: Datensatz

source: Output folder
de_de: Ausgabeordner

source: Resume previous training
de_de: Früheres Training fortführen

source: Training directory
de_de: Trainingordner

source: Resume after
de_de: Fortfahren nach

source: Start Training
de_de: Training starten

source: Start training
de_de: Training starten

source: Select training directory
de_de: Trainingordner auswählen

source: Accuracy
de_de: Genauigkeit

source: Applying config of previous training failed
de_de: Einstellungen des früheren Trainings werden übernommen

source: Could not detect format of selected dataset
de_de: Das Format des ausgewählten Datensatzes konnte nicht ermittelt werden

source: No labels found in dataset
de_de: Keine Labels im Datensatz gefunden

source: Please select a valid training dataset
de_de: Bitte wählen Sie einen gültigen Trainingordner

source: Training and validation dataset are equal. Please use different datasets, as validation results are useless otherwise.
de_de: Training- und Validierungsdatensatz sind identisch. Bitte nutzen Sie unterschiedliche Datensätze, da die Validierungsergebnisse ansonsten unbrauchbar sind.

source: Please enter a valid training name
de_de: Bitte wählen Sie einen gültigen Trainingnamen

source: The selected output directory "{}" is not empty. Please select a different directory.
de_de: Der Ordner "{}" ist nicht leer. Bitte wählen Sie ein anderes Verzeichnis.

source: Network has been trained successfully
de_de: Netz wurde erfolgreich trainiert

source: of
de_de: von

source: Duration
de_de: Dauer

source: Time left
de_de: Verbleibende Zeit

source: Metric
de_de: Metrik

source: Last validation
de_de: Letzte Validierung

source: Are you sure to cancel to current training session? The last completed epoch will be saved. Remember: Shorter training time leeds to worse results.
de_de: Wollen Sie die aktuelle Trainingsitzung wirklich abbrechen? Die letzte vollständige Epoche wird gespeichert.

source: The GPU ran out of memory. Please close other applications that occupy GPU memory and try to decrease the batch size for training. The current batch size was {}.
de_de: Die GPU hat nicht genügend freien Speicherplatz. Bitte schließen Sie andere Anwendungen, die Speicher auf der GPU verbrauchen, und versuchen Sie die Stapelgröße für das Training zu reduzieren. Die aktuelle Stapelgröße war {}.

source: Network {} could not be found
de_de: Netz {} konnte nicht gefunden werden

source: Input image
de_de: Eingabebild

source: Validate
de_de: Validieren

source: Image files
de_de: Bilddateien

source: Select input image
de_de: Eingabebild auswählen

source: Please select a valid input image
de_de: Bitte wählen Sie ein gültiges Eingabebild

source: Please select a valid training directory
de_de: Bitte wählen Sie einen gültigen Trainingordner
